tutorials/combustion/fireFoam/LES/simplePMMApanel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name        coupledPatch;
        type        faceSet;
        action      new;
        source      patchToFace;
        sourceInfo
        {
            name    coupledPatch;
        }
    }

    {
        name        panel;
        type        faceZoneSet;
        action      new;
        source      setToFaceZone;
        sourceInfo
        {
            faceSet coupledPatch;
        }
    }
);

// ************************************************************************* //
